{"_id":{"$oid":"5798c1fc1a308e4105d80e08"},"word":"Harangue","meaning":"A lengthy and aggressive speech","level":"Common Words 1","example":"they were subjected to a ten-minute harangue by two border guards","synonym":""}
{"_id":{"$oid":"5798c2161a308e4105d80e09"},"word":"Ambiguous","meaning":"Not having one obvious meaning","level":"Common Words 1","example":"The coach told his team, “Move towards that side of the field”; because he did not point, his directions were ambiguous, and the team had no idea to which side he was referring.","synonym":""}
{"_id":{"$oid":"5798cc692fba723e1e3e6a70"},"word":"Halcyon","level":"Advanced 7","meaning":"Idyllically calm and peaceful; suggesting happy tranquillity; marked by peace and prosperity","example":"The first decade after WWI was a halcyon period in America with new-found wealth and rapidly improving technology.","synonym":""}
{"_id":{"$oid":"5798ef05d85bc82c29116464"},"word":"Censure","level":"Common Words 1","meaning":"To express strong disapproval                                  ","example":"After being caught in bed with a mistress, the mayor was quickly censured by the city council.","synonym":""}
{"_id":{"$oid":"5798ef33d85bc82c29116465"},"word":"Auspicious","level":"Common Words 1","meaning":"Favorable, the opposite of sinister","example":"Despite an auspicious beginning, Mike’s road trip became a series of mishaps, and he was soon stranded and penniless, leaning against his wrecked automobile."}
{"_id":{"$oid":"5798ef5cd85bc82c29116466"},"word":"Innocuous","level":"Common Words 1","meaning":"Harmless and doesn’t produce any ill effects","example":"Everyone found Nancy’s banter innocuous—except for Mike, who felt like she was intentionally picking on him.\r\n"}
{"_id":{"$oid":"5798ef84d85bc82c29116467"},"word":"Galvanize","level":"Common Words 1","meaning":"To excite or inspire (someone) to action\r\n","example":"At mile 23 of his first marathon, Kyle had all but given up, until he noticed his friends and family holding a banner that read, “Go Kyle”; galvanized, he broke into a gallop, finishing the last three miles in less than 20 minutes.\r\n","synonym":""}
{"_id":{"$oid":"5798efa6d85bc82c29116468"},"word":"Aberration","level":"Common Words 1","meaning":"A deviation from what is normal or expected\r\n","example":"Aberrations in climate have become the norm: rarely a week goes by without some meteorological phenomenon making headlines.\r\n","synonym":""}
{"_id":{"$oid":"5798efe7d85bc82c29116469"},"word":"Equivocal","level":"Common Words 1","meaning":"Confusing or ambiguous","example":"The findings of the study were equivocal—the two researchers had different opinions on what the results signified.\r\n","synonym":""}
{"_id":{"$oid":"5798f00cd85bc82c2911646a"},"word":"Anomalous","level":"Common Words 1","meaning":"Not normal","example":"According to those who do not believe in climate change, the extreme weather over the last five years is simply anomalous—daily temperatures should return to their old averages, they believe.\r\n","synonym":""}
{"_id":{"$oid":"5798f032d85bc82c2911646b"},"word":"Gregarious","level":"Common Words 1","meaning":"To be likely to socialize with others","example":"Often we think that great leaders are those who are gregarious, always in the middle of a large group of people; yet, as Mahatma Gandhi and many others have shown us, leaders can also be introverted.\r\n","synonym":""}
{"_id":{"$oid":"5798f073d85bc82c2911646c"},"word":"Amalgam","level":"Common Words 1","meaning":"A mixture of multiple things","example":"The band’s music was an amalgam of hip-hop, flamenco and jazz, blending the three styles with surprising results.\r\n","synonym":""}
{"_id":{"$oid":"5798f099d85bc82c2911646d"},"word":"Egregious","level":"Common Words 1","meaning":"Standing out in a negative way; shockingly bad","example":"The dictator’s abuse of human rights was so egregious that many world leaders demanded that he be tried in an international court for genocide.\r\n"}
{"_id":{"$oid":"5798f0c5d85bc82c2911646e"},"word":"Artful","level":"Common Words 1","meaning":"Exhibiting artistic skill","example":"Picasso is generally considered the most artful member of the Cubist movement.","synonym":""}
{"_id":{"$oid":"5798f11fd85bc82c2911646f"},"word":"Intimate","level":"Common Words 1","meaning":"To suggest something subtly","example":"At first Manfred’s teachers intimated to his parents that he was not suited to skip a grade; when his parents protested, teachers explicitly told them that, notwithstanding the boy’s precocity, he was simply too immature to jump to the 6th grade.\r\n","synonym":""}
{"_id":{"$oid":"5798f142d85bc82c29116470"},"word":"Ambivalent","level":"Common Words 1","meaning":"Mixed or conflicting emotions about something","example":"Sam was ambivalent about studying for the exam because doing so ate up a lot of his time, yet he was able to improve his analytical skills."}
{"_id":{"$oid":"5798f163d85bc82c29116471"},"word":"Venerate","level":"Common Words 1","meaning":"To respect deeply","example":"The professor, despite his sleep-inducing lectures, was venerated amongst his colleagues, publishing more papers yearly than all of his peers combined.\r\n","synonym":""}
{"_id":{"$oid":"5798f18ed85bc82c29116472"},"word":"Impertinent","level":"Common Words 1","meaning":"Being disrespectful; improperly forward or bold","example":"Dexter, distraught over losing his pet dachshund, Madeline, found the police officer’s questions impertinent—after all, he thought, did she have to pry into such details as to what Madeline’s favorite snack was?"}
{"_id":{"$oid":"5798f1aad85bc82c29116473"},"word":"Belie","level":"Common Words 1","meaning":"To give a false representation to; misrepresent","example":"The smile on her face belies the pain she must feel after the death of her husband."}
{"_id":{"$oid":"5798f215d85bc82c29116474"},"word":"Venality","level":"Common Words 1","meaning":"The condition of being susceptible to bribes or corruption","example":"Even some of the most sacred sporting events are not immune to venality, as many of the officials have receied substantial bribes to make biased calls.\r\n"}
{"_id":{"$oid":"5798f33ad85bc82c29116475"},"word":"Frugal","level":"Common Words 1","meaning":"Not spending much money (but spending wisely)","example":"Monte was no miser, but was simply frugal, wisely spending the little that he earned."}
{"_id":{"$oid":"5798f355d85bc82c29116476"},"word":"Maintain","level":"Common Words 1","meaning":"To assert","example":"The scientist maintained that the extinction of dinosaurs was most likely brought about by a drastic change in climate.","synonym":""}
{"_id":{"$oid":"5798f3e491d9e3172c560cdd"},"word":"Veracious","level":"Common Words 1","meaning":"Truthful","example":"While we elect our leaders in the hope that every word they speak will be veracious, history has shown that such a hope is naive.\r\n","synonym":""}
{"_id":{"$oid":"5798f49a91d9e3172c560cde"},"word":"Laconic","level":"Common Words 1","meaning":"(describes a person, speech, or style of writing) using very few words","example":"While Martha always swooned over the hunky, laconic types in romantic comedies, her boyfriends inevitably were very talkative—and not very hunky.","synonym":""}
{"_id":{"$oid":"5798f4c291d9e3172c560cdf"},"word":"Parochial","level":"Common Words 1","meaning":"Narrowly restricted in scope or outlook","example":"Jasmine was sad to admit it, but her fledgling relationship with Jacob did not work out because his culinary tastes were simply too parochial; \"After all,\" she quipped on her blog, \"he considered Chef Boyardee ethnic food.\"\r\n","synonym":""}
{"_id":{"$oid":"5798f4f391d9e3172c560ce0"},"word":"Castigate","level":"Common Words 1","meaning":"To reprimand harshly","example":"Drill sergeants are known to castigate new recruits so mercilessly that the latter often break down during their first week in training.","synonym":""}
{"_id":{"$oid":"5798f51591d9e3172c560ce1"},"word":"Iconoclast","level":"Common Words 1","meaning":"Somebody who attacks cherished beliefs or institutions","example":"Lady Gaga, in challenging what it means to be clothed, is an iconoclast for wearing a \"meat dress\" to a prominent awards show.","synonym":""}
{"_id":{"$oid":"5798f55291d9e3172c560ce2"},"word":"Parsimonious","level":"Common Words 1","meaning":"Extremely frugal; miserly","example":"Katie is so parsimonious that she only buys a pair of socks if all of her other socks have holes in them."}
{"_id":{"$oid":"5798f58891d9e3172c560ce3"},"word":"Acrimony","level":"Common Words 1","meaning":"Bitterness and ill will","example":"The acrimony between the president and vice-president sent a clear signal to voters: the health of the current administration was imperiled.","synonym":""}
{"_id":{"$oid":"5798f5ca91d9e3172c560ce4"},"word":"Vindicate","level":"Common Words 1","meaning":"To clear of accusation, blame, suspicion, or doubt with supporting arguments or proof","example":"Even seven Tour de France wins cannot vindicate Lance Armstrong in the eyes of the public--that the athlete used performance enhancing drugs invalidates all those wins.","synonym":""}
{"_id":{"$oid":"5798f5f591d9e3172c560ce5"},"word":"Disinterested","level":"Common Words 1","meaning":"Unbiased; neutral","example":"The potential juror knew the defendant, and therefore could not serve on the jury, which must consist only of disinterested members.","synonym":""}
{"_id":{"$oid":"5798f91a91d9e3172c560ce6"},"word":"Commensurate","level":"Common Words 1","meaning":"To be in proportion or corresponding in degree or amount","example":"The convicted felon’s life sentence was commensurate with the heinousness of his crime."}
{"_id":{"$oid":"5798f94291d9e3172c560ce7"},"word":"Amorphous","level":"Common Words 1","meaning":"Shapeless","example":"His study plan for the GRE was at best amorphous; he would do questions from random pages in any one of seven test prep books.","synonym":""}
{"_id":{"$oid":"5798f98d91d9e3172c560ce8"},"word":"Calumny","level":"Common Words 1","meaning":"Making of a false statement meant to injure a person’s reputation","example":"With the presidential primaries well under way, the air is thick with calumny, and the mud already waist-high.","synonym":""}
{"_id":{"$oid":"5798f9b991d9e3172c560ce9"},"word":"Prodigal","level":"Common Words 1","meaning":"Rashly or wastefully extravagant","example":"Successful professional athletes who do not fall prey to prodigality seem to be the exception—most live decadent lives.","synonym":""}
{"_id":{"$oid":"579971a72d1fa77c31856b0e"},"word":"Mercurial","level":"Common Words 1","meaning":"(of a person) prone to unexpected and unpredictable changes in mood","example":"The fact that Ella’s moods were as mercurial as the weather was problematic for her relationships—it didn’t help that she lived in Chicago.","synonym":""}
{"_id":{"$oid":"579972842d1fa77c31856b0f"},"word":"Chastise","level":"Common Words 1","meaning":"To reprimand harshly","example":"Though chastised for eating the snacks for the party, Lawrence shrugged off his mother’s harsh words, and continued to plow through jars of cookies and boxes of donuts.","synonym":""}
{"_id":{"$oid":"579973592d1fa77c31856b10"},"word":"Amenable","level":"Common Words 1","meaning":"Easily persuaded","example":"Even though she did not like the outdoors, Shirley was generally amenable and so her brother was able to persuade her to go camping.","synonym":""}
{"_id":{"$oid":"5799739e2d1fa77c31856b11"},"word":"Involved","level":"Common Words 1","meaning":"Complicated, and difficult to comprehend","example":"The physics lecture became so involved that the undergraduate’s eyes glazed over.","synonym":""}
{"_id":{"$oid":"579973bd2d1fa77c31856b12"},"word":"Undermine","level":"Common Words 1","meaning":"To weaken (usually paired with an abstract term)","example":"The student undermined the teacher’s authority by questioning the teacher’s judgment on numerous occasions.","synonym":""}
{"_id":{"$oid":"5799743a2d1fa77c31856b13"},"word":"Prevaricate","level":"Common Words 1","meaning":"To speak in an evasive way","example":"The cynic quipped, “There is not much variance in politicians; they all seem to prevaricate”.","synonym":""}
{"_id":{"$oid":"579974672d1fa77c31856b14"},"word":"Demur","level":"Common Words 1","meaning":"To object or show reluctance","example":"Wallace disliked the cold, so he demurred when his friends suggested they go skiing in the Alps.","synonym":""}
{"_id":{"$oid":"579974c52d1fa77c31856b15"},"word":"Betray","level":"Common Words 1","meaning":"To reveal or make known something, usually unintentionally","example":"With the gold medal at stake, the gymnast awaited his turn, his quivering lip betraying his intense emotions.","synonym":""}
{"_id":{"$oid":"579975172d1fa77c31856b16"},"word":"Qualify","level":"Common Words 1","meaning":"To make less severe; to limit (a statement)","example":"Chris qualified his love for San Francisco, adding he didn't like the weather there as much as he liked the weather in Los Angeles.","synonym":""}
{"_id":{"$oid":"579975cc2d1fa77c31856b17"},"word":"Ingenuous","level":"Common Words 1","meaning":"To be naïve and innocent","example":"Two-years in Manhattan had changed Jenna from an ingenuous girl from the suburbs to a jaded urbanite, unlikely to fall for any ruse, regardless of how elaborate.","synonym":""}
{"_id":{"$oid":"579976c32d1fa77c31856b18"},"word":"Restive","level":"Common Words 1","meaning":"Restless","example":"The crowd grew restive as the comedian’s opening jokes fell flat.","synonym":""}
{"_id":{"$oid":"5799771c2d1fa77c31856b19"},"word":"Profligate","level":"Common Words 1","meaning":"Spending resources recklessly or wastefully","example":"The composer Wagner, while living on a limited salary, was so profligate as to line all the walls of his apartment with pure silk.","synonym":""}
{"_id":{"$oid":"579978032d1fa77c31856b1a"},"word":"Wanting","level":"Common Words 1","meaning":"Lacking","example":"She did not think her vocabulary was wanting, yet there were so many words that inevitably she found a few she didn't know.","synonym":""}
{"_id":{"$oid":"579979122d1fa77c31856b1b"},"word":"Extant","level":"Common Words 1","meaning":"Still in existence (usually refers to documents).","example":"Despite many bookstores closing, experts predict that some form of book dealing will still be extant generations from now.","synonym":""}
{"_id":{"$oid":"57997a502d1fa77c31856b1c"},"word":"Upbraid","level":"Common Words 1","meaning":"To reproach; to scold","example":"Bob took a risk walking into the \"Students Barbershop\"—in the end he had to upbraid the apparently drunk barber for giving him an uneven bowl cut.","synonym":""}
{"_id":{"$oid":"579cad109c9fe1736ba9fd2e"},"word":"Predilection","level":"Common Words 2","meaning":"A strong liking","example":"Monte had a predilection for the fine things in life: Cuban cigars, 200 dollar bottles of wine, and trips to the French Riviera.\r\n"}
{"_id":{"$oid":"579cb7a8f7eab1646c8eb942"},"word":"Meticulous","level":"Common Words 2","meaning":"Marked by extreme care in treatment of details","example":"The Japanese noodle maker was meticulous in making his noodles and would never let another person take over the task.","synonym":""}
{"_id":{"$oid":"579cb7c4f7eab1646c8eb943"},"word":"Engender","level":"Common Words 2","meaning":"Give rise to","example":"The restrictions of the Treaty of Versailles were so severe that they engendered deep hatred and resentment in the German people.","synonym":""}
{"_id":{"$oid":"579cb80af7eab1646c8eb944"},"word":"Concede","level":"Common Words 2","meaning":"Acknowledge defeat","example":"After a long, stern lecture from her father, Olivia conceded to having broken the window.","synonym":""}
{"_id":{"$oid":"579cb82ef7eab1646c8eb945"},"word":"Fortuitous","level":"Common Words 2","meaning":"Occurring by happy chance; having no cause or apparent cause","example":"Though Maria's neighbor Ernie \"bumped into\" her at the Farmer's Market, the encounter wasn't nearly as fortuitous as Maria was led to believe: Ernie desperately wanted to ask Maria out on a date and had been following her about town.","synonym":""}
{"_id":{"$oid":"579cb843f7eab1646c8eb946"},"word":"Diffident","level":"Common Words 2","meaning":"Showing modest reserve; lacking self-confidence","example":"As a young girl she was diffident and reserved, but now as an adult, she is confident and assertive.","synonym":""}
{"_id":{"$oid":"579cb861f7eab1646c8eb947"},"word":"Glut","level":"Common Words 2","meaning":"An excessive supply","example":"The Internet offers such a glut of news related stories that many find it difficult to know which story to read first.","synonym":""}
{"_id":{"$oid":"579cb8a8f7eab1646c8eb948"},"word":"Recondite","level":"Common Words 2","meaning":"Difficult to penetrate; incomprehensible to one of ordinary understanding or knowledge","example":"I found Ulysses recondite and never finished the book, waiting instead to read it with someone else so we could penetrate its meaning together.","synonym":""}
{"_id":{"$oid":"579cb922f7eab1646c8eb94a"},"word":"Didactic","level":"Common Words 2","meaning":"Instructive (especially excessively)","example":"Tolstoy's The Death of Ivan Ilyich is a didactic novel, instructing the reader on how to live a good life.","synonym":""}
{"_id":{"$oid":"579cb939f7eab1646c8eb94b"},"word":"Dogmatic","level":"Common Words 2","meaning":"Highly opinionated, not accepting that your belief may not be correct","example":"Bryan is dogmatic in his belief that the earth is flat, claiming that all pictures of a spherical earth are computer generated.","synonym":""}
{"_id":{"$oid":"579cb954f7eab1646c8eb94c"},"word":"Mitigate","level":"Common Words 2","meaning":"Make less severe or harsh","example":"I can only spend so much time mitigating your disagreements with your wife, and at certain point, you need to do it on your own.","synonym":""}
{"_id":{"$oid":"579cb978f7eab1646c8eb94d"},"word":"Culpability","level":"Common Words 2","meaning":"A state of guilt","example":"Since John had left his banana peel at the top of the stairwell, he accepted culpability for Martha's broken leg.","synonym":""}
{"_id":{"$oid":"579cb98bf7eab1646c8eb94e"},"word":"Decorous","level":"Common Words 2","meaning":"Characterized by good taste in manners and conduct","example":"Sally's parties are decorous affairs, and instead of the usual beer and music, there is tea and intellectual conversation.","synonym":""}
{"_id":{"$oid":"579cb9aaf7eab1646c8eb94f"},"word":"Prescience","level":"Common Words 2","meaning":"The power to foresee the future","example":"Baxter's warnings about investing in technology stocks seemed like an act of prescience after the whole market declined significantly.","synonym":""}
{"_id":{"$oid":"579cb9c0f7eab1646c8eb950"},"word":"Frivolous","level":"Common Words 2","meaning":"Not serious in content or attitude or behavior","example":"Compared to Juliet's passionate concern for human rights, Jake's non-stop concern about football seems somewhat frivolous.","synonym":""}
{"_id":{"$oid":"579cb9eff7eab1646c8eb951"},"word":"Perfidy","level":"Common Words 2","meaning":"An act of deliberate betrayal; a breach of a trust","example":"Sure, he was the best salesman in the company; but Michael had abused the trust of the firm, sharing product secrets with a competitor, and for such perfidy he was terminated.","synonym":""}
{"_id":{"$oid":"579cba0af7eab1646c8eb952"},"word":"Bucolic","level":"Common Words 2","meaning":"Relating to the pleasant aspects of the country","example":"The noble families of England once owned vast expanses of beautiful, bucolic land.","synonym":""}
{"_id":{"$oid":"579cba20f7eab1646c8eb953"},"word":"Chortle","level":"Common Words 2","meaning":"To chuckle, laugh merrily, often in a breathy, muffled way","example":"Walking into the cafe, I could hear happy, chortling people and smell the rich aroma of roasted coffee beans.","synonym":""}
{"_id":{"$oid":"579cba34f7eab1646c8eb954"},"word":"Aesthetic","level":"Common Words 2","meaning":"Concerned with the appreciation of beauty","example":"The director, not known for his aesthetic sensibilities, decided not to use costumes at all, and put on the play in everyday clothing.","synonym":""}
{"_id":{"$oid":"579cba4cf7eab1646c8eb955"},"word":"Culminate","level":"Common Words 2","meaning":"Reach the highest or most decisive point","example":"Beethoven's musical genius culminated in the 9th Symphony, which many consider his greatest work.","synonym":""}
{"_id":{"$oid":"579cba67f7eab1646c8eb956"},"word":"Superfluous","level":"Common Words 2","meaning":"Serving no useful purpose","example":"How can we hope to stay open if we don't eliminate all superfluous spending, like catered meetings and free acupuncture Tuesday?","synonym":""}
{"_id":{"$oid":"579cba7bf7eab1646c8eb957"},"word":"Incisive","level":"Common Words 2","meaning":"Having or demonstrating ability to recognize or draw fine distinctions","example":"The lawyer had an incisive mind, able in a flash to dissect a hopelessly tangled issue and isolate the essential laws at play.","synonym":""}
{"_id":{"$oid":"579cba91f7eab1646c8eb958"},"word":"Impudent","level":"Common Words 2","meaning":"Improperly forward or bold","example":"In an impudent move, the defendant spoke out of order to say terribly insulting things to the judge.","synonym":""}
{"_id":{"$oid":"579cbaabf7eab1646c8eb959"},"word":"Entrenched","level":"Common Words 2","meaning":"Fixed firmly or securely","example":"By the time we reach 60-years old, most of our habits are so entrenched that it is difficult for us to change.","synonym":""}
{"_id":{"$oid":"579cbac2f7eab1646c8eb95a"},"word":"Dictatorial","level":"Common Words 2","meaning":"Expecting unquestioning obedience; characteristic of an absolute ruler","example":"The coach was dictatorial in his approach: no players could ever argue or question his approach.","synonym":""}
{"_id":{"$oid":"579cbadef7eab1646c8eb95b"},"word":"Banal","level":"Common Words 2","meaning":"Repeated too often; overfamiliar through overuse","example":"The professor used such banal expression that many students in the class either fell asleep from boredom or stayed awake to complete his sentences and humor friends.","synonym":""}
{"_id":{"$oid":"579cbaf1f7eab1646c8eb95c"},"word":"Gainsay","level":"Common Words 2","meaning":"Deny or contradict; speak against or oppose","example":"I can't gainsay a single piece of evidence James has presented, but I still don't trust his conclusion.","synonym":""}
{"_id":{"$oid":"579cbb06f7eab1646c8eb95d"},"word":"Gossamer","level":"Common Words 2","meaning":"Characterized by unusual lightness and delicacy","example":"The gossamer wings of a butterfly, which allow it to fly, are also a curse, so delicate that they are often damaged.","synonym":""}
{"_id":{"$oid":"579cbb36f7eab1646c8eb95e"},"word":"Germane","level":"Common Words 2","meaning":"Relevant and appropriate","example":"The professor wanted to tell the jury in detail about his new book, but the lawyer said it wasn't germane to the charges in the cases.","synonym":""}
{"_id":{"$oid":"579cbb4ff7eab1646c8eb95f"},"word":"Preclude","level":"Common Words 2","meaning":"Keep from happening or arising; make impossible","example":"The manager specified that all other gates be locked, to preclude the possibility of persons without tickets entering the arena undetected.","synonym":""}
{"_id":{"$oid":"579cbb6cf7eab1646c8eb960"},"word":"Rustic","level":"Common Words 2","meaning":"Characteristic of rural life; awkwardly simple and provincial","example":"The vacation cabin had no electricity and no indoor plumbing, but despite these inconveniences, Nigel adored its rustic charm.","synonym":""}
{"_id":{"$oid":"579cbb7ef7eab1646c8eb961"},"word":"Vociferous","level":"Common Words 2","meaning":"Conspicuously and offensively loud; given to vehement outcry","example":"In giving Marcia a particular vociferous response, Paul caused people at every other table in the restaurant to turn around and look at them angrily.","synonym":""}
{"_id":{"$oid":"579cbb97f7eab1646c8eb962"},"word":"Aesthete","level":"Common Words 2","meaning":"One who professes great sensitivity to the beauty of art and nature","example":"A true aesthete, Marty would spend hours at the Guggenheim Museum, staring at the same Picasso.","synonym":""}
{"_id":{"$oid":"579cbbaaf7eab1646c8eb963"},"word":"Reticent","level":"Common Words 2","meaning":"Disinclined to talk, not revealing one's thoughts","example":"When asked about her father, Helen lost her outward enthusiasm and became rather reticent.","synonym":""}
{"_id":{"$oid":"579cbbc1f7eab1646c8eb964"},"word":"Eschew","level":"Common Words 2","meaning":"Avoid and stay away from deliberately; stay clear of","example":"Politicians are the masters of eschewing morals; academics are the masters of eschewing clarity.","synonym":""}
{"_id":{"$oid":"579cbbddf7eab1646c8eb965"},"word":"Gall","level":"Common Words 2","meaning":"The trait of being rude and impertinent","example":"The speeding car had the gall to switch five lanes at once, run through a red light, and then cut off a police car before finally coming to a stop in front of a sea of flashing red lights.","synonym":""}
{"_id":{"$oid":"579cbbf5f7eab1646c8eb966"},"word":"Obscure","level":"Common Words 2","meaning":"Make unclear","example":"On the Smith's drive through the Grand Canyon, Mr. Smith's big head obscured much of Mrs. Robinson's view, so that she only saw momentary patches of red rock.","synonym":""}
{"_id":{"$oid":"579cbc0cf7eab1646c8eb967"},"word":"Mawkish","level":"Common Words 2","meaning":"Overly sentimental to the point that it is disgusting","example":"The film was incredibly mawkish, introducing highly likeable characters only to have them succumb to a devastating illness by the end of the movie.","synonym":""}
{"_id":{"$oid":"579cbc20f7eab1646c8eb968"},"word":"Audacious","level":"Common Words 2","meaning":"Willing to be bold in social situations or to take risks","example":"As all of the other campers cowered in their tents, Bill, armed only with a flashlight, audaciously tracked down the bear that had raided their food.","synonym":""}
{"_id":{"$oid":"579cbc35f7eab1646c8eb969"},"word":"Volubility","level":"Common Words 2","meaning":"The quality of talking or writing easily and continuously","example":"The professor's volubility knows no bounds; he could talk through a hurricane and elaborate a point from one St. Patrick's Day to the next.","synonym":""}
{"_id":{"$oid":"579cbc56f7eab1646c8eb96a"},"word":"Cryptic","level":"Common Words 2","meaning":"Mysterious or vague, usually intentionally","example":"Since Sarah did not want her husband to guess the Christmas present she had bought him, she only answered cryptically when he would ask her questions about it.","synonym":""}
{"_id":{"$oid":"579cbc73f7eab1646c8eb96b"},"word":"Deferential","level":"Common Words 2","meaning":"Showing respect","example":"If you ever have the chance to meet the president, stand up straight and be deferential.","synonym":""}
{"_id":{"$oid":"579cbc87f7eab1646c8eb96c"},"word":"Platitude","level":"Common Words 2","meaning":"A trite or obvious remark","example":"The professor argued that many statements regarded as wise in previous times, such as the Golden Rule, are now regarded as mere platitudes.","synonym":""}
{"_id":{"$oid":"579cbc9df7eab1646c8eb96d"},"word":"Querulous","level":"Common Words 2","meaning":"Habitually complaining","example":"The querulous old woman was beginning to wear down even the happier members of the staff with her ceaseless complaining.","synonym":""}
{"_id":{"$oid":"579cbcb8f7eab1646c8eb96e"},"word":"Torpor","level":"Common Words 2","meaning":"Inactivity resulting from lethargy and lack of vigor or energy","example":"After work, I was expecting my colleagues to be enthusiastic about the outing, but I found them in a state of complete torpor.","synonym":""}
{"_id":{"$oid":"579cbd00f7eab1646c8eb96f"},"word":"Conspicuous","level":"Common Words 2","meaning":"Without any attempt at concealment; completely obvious","example":"American basketball players are always conspicuous when they go abroad--not only are they American, but some are over seven feet tall.","synonym":""}
{"_id":{"$oid":"579cbd14f7eab1646c8eb970"},"word":"Exacerbate","level":"Common Words 2","meaning":"Make worse","example":"Her sleeplessness exacerbated her cold--when she woke up the next day, her sinuses were completely blocked.","synonym":""}
{"_id":{"$oid":"579cbd2ef7eab1646c8eb971"},"word":"Inexorable","level":"Common Words 2","meaning":"Impossible to stop or prevent","example":"The rise of the computer was an inexorable shift in technology and culture.","synonym":""}
{"_id":{"$oid":"579cbd45f7eab1646c8eb972"},"word":"Apathetic","level":"Common Words 2","meaning":"Marked by a lack of interest","example":"Mr. Thompson was so talented at teaching math that even normally apathetic students took interest.","synonym":""}
{"_id":{"$oid":"579cbd5cf7eab1646c8eb973"},"word":"Lambast","level":"Common Words 2","meaning":"Criticize severely or angrily","example":"Showing no patience, the manager utterly lambasted the sales team that lost the big account.","synonym":""}
