{"_id":{"$oid":"5798c1fc1a308e4105d80e08"},"word":"Harangue","meaning":"A lengthy and aggressive speech","level":"Common Words 1","example":"they were subjected to a ten-minute harangue by two border guards","synonym":""}
{"_id":{"$oid":"5798c2161a308e4105d80e09"},"word":"Ambiguous","meaning":"Not having one obvious meaning","level":"Common Words 1","example":"The coach told his team, “Move towards that side of the field”; because he did not point, his directions were ambiguous, and the team had no idea to which side he was referring.","synonym":""}
{"_id":{"$oid":"5798cc692fba723e1e3e6a70"},"word":"Halcyon","level":"Advanced 7","meaning":"Idyllically calm and peaceful; suggesting happy tranquillity; marked by peace and prosperity","example":"The first decade after WWI was a halcyon period in America with new-found wealth and rapidly improving technology.","synonym":""}
{"_id":{"$oid":"5798ef05d85bc82c29116464"},"word":"Censure","level":"Common Words 1","meaning":"To express strong disapproval                                  ","example":"After being caught in bed with a mistress, the mayor was quickly censured by the city council.","synonym":""}
{"_id":{"$oid":"5798ef33d85bc82c29116465"},"word":"Auspicious","level":"Common Words 1","meaning":"Favorable, the opposite of sinister","example":"Despite an auspicious beginning, Mike’s road trip became a series of mishaps, and he was soon stranded and penniless, leaning against his wrecked automobile."}
{"_id":{"$oid":"5798ef5cd85bc82c29116466"},"word":"Innocuous","level":"Common Words 1","meaning":"harmless and doesn’t produce any ill effects","example":"Everyone found Nancy’s banter innocuous—except for Mike, who felt like she was intentionally picking on him.\r\n","synonym":""}
{"_id":{"$oid":"5798ef84d85bc82c29116467"},"word":"Galvanize","level":"Common Words 1","meaning":"To excite or inspire (someone) to action\r\n","example":"At mile 23 of his first marathon, Kyle had all but given up, until he noticed his friends and family holding a banner that read, “Go Kyle”; galvanized, he broke into a gallop, finishing the last three miles in less than 20 minutes.\r\n","synonym":""}
{"_id":{"$oid":"5798efa6d85bc82c29116468"},"word":"Aberration","level":"Common Words 1","meaning":"A deviation from what is normal or expected\r\n","example":"Aberrations in climate have become the norm: rarely a week goes by without some meteorological phenomenon making headlines.\r\n","synonym":""}
{"_id":{"$oid":"5798efe7d85bc82c29116469"},"word":"Equivocal","level":"Common Words 1","meaning":"Confusing or ambiguous","example":"The findings of the study were equivocal—the two researchers had different opinions on what the results signified.\r\n","synonym":""}
{"_id":{"$oid":"5798f00cd85bc82c2911646a"},"word":"Anomalous","level":"Common Words 1","meaning":"Not normal","example":"According to those who do not believe in climate change, the extreme weather over the last five years is simply anomalous—daily temperatures should return to their old averages, they believe.\r\n","synonym":""}
{"_id":{"$oid":"5798f032d85bc82c2911646b"},"word":"Gregarious","level":"Common Words 1","meaning":"To be likely to socialize with others","example":"Often we think that great leaders are those who are gregarious, always in the middle of a large group of people; yet, as Mahatma Gandhi and many others have shown us, leaders can also be introverted.\r\n","synonym":""}
{"_id":{"$oid":"5798f073d85bc82c2911646c"},"word":"Amalgam","level":"Common Words 1","meaning":"A mixture of multiple things","example":"The band’s music was an amalgam of hip-hop, flamenco and jazz, blending the three styles with surprising results.\r\n","synonym":""}
{"_id":{"$oid":"5798f099d85bc82c2911646d"},"word":"Egregious","level":"Common Words 1","meaning":"standing out in a negative way; shockingly bad","example":"The dictator’s abuse of human rights was so egregious that many world leaders demanded that he be tried in an international court for genocide.\r\n","synonym":""}
{"_id":{"$oid":"5798f0c5d85bc82c2911646e"},"word":"Artful","level":"Common Words 1","meaning":"Exhibiting artistic skill","example":"Picasso is generally considered the most artful member of the Cubist movement.","synonym":""}
{"_id":{"$oid":"5798f11fd85bc82c2911646f"},"word":"Intimate","level":"Common Words 1","meaning":"To suggest something subtly","example":"At first Manfred’s teachers intimated to his parents that he was not suited to skip a grade; when his parents protested, teachers explicitly told them that, notwithstanding the boy’s precocity, he was simply too immature to jump to the 6th grade.\r\n","synonym":""}
{"_id":{"$oid":"5798f142d85bc82c29116470"},"word":"Ambivalent","level":"Common Words 1","meaning":"Mixed or conflicting emotions about something","example":"Sam was ambivalent about studying for the exam because doing so ate up a lot of his time, yet he was able to improve his analytical skills."}
{"_id":{"$oid":"5798f163d85bc82c29116471"},"word":"Venerate","level":"Common Words 1","meaning":"To respect deeply","example":"The professor, despite his sleep-inducing lectures, was venerated amongst his colleagues, publishing more papers yearly than all of his peers combined.\r\n","synonym":""}
{"_id":{"$oid":"5798f18ed85bc82c29116472"},"word":"Impertinent","level":"Common Words 1","meaning":"being disrespectful; improperly forward or bold","example":"Dexter, distraught over losing his pet dachshund, Madeline, found the police officer’s questions impertinent—after all, he thought, did she have to pry into such details as to what Madeline’s favorite snack was?","synonym":""}
{"_id":{"$oid":"5798f1aad85bc82c29116473"},"word":"Belie","level":"Common Words 1","meaning":"To give a false representation to; misrepresent","example":"The smile on her face belies the pain she must feel after the death of her husband."}
{"_id":{"$oid":"5798f215d85bc82c29116474"},"word":"Venality","level":"Common Words 1","meaning":"the condition of being susceptible to bribes or corruption","example":"Even some of the most sacred sporting events are not immune to venality, as many of the officials have receied substantial bribes to make biased calls.\r\n","synonym":""}
{"_id":{"$oid":"5798f33ad85bc82c29116475"},"word":"Frugal","level":"Common Words 1","meaning":"not spending much money (but spending wisely)","example":"Monte was no miser, but was simply frugal, wisely spending the little that he earned.","synonym":""}
{"_id":{"$oid":"5798f355d85bc82c29116476"},"word":"Maintain","level":"Common Words 1","meaning":"To assert","example":"The scientist maintained that the extinction of dinosaurs was most likely brought about by a drastic change in climate.","synonym":""}
{"_id":{"$oid":"5798f3e491d9e3172c560cdd"},"word":"Veracious","level":"Common Words 1","meaning":"Truthful","example":"While we elect our leaders in the hope that every word they speak will be veracious, history has shown that such a hope is naive.\r\n","synonym":""}
{"_id":{"$oid":"5798f49a91d9e3172c560cde"},"word":"Laconic","level":"Common Words 1","meaning":"(describes a person, speech, or style of writing) using very few words","example":"While Martha always swooned over the hunky, laconic types in romantic comedies, her boyfriends inevitably were very talkative—and not very hunky.","synonym":""}
{"_id":{"$oid":"5798f4c291d9e3172c560cdf"},"word":"Parochial","level":"Common Words 1","meaning":"Narrowly restricted in scope or outlook","example":"Jasmine was sad to admit it, but her fledgling relationship with Jacob did not work out because his culinary tastes were simply too parochial; \"After all,\" she quipped on her blog, \"he considered Chef Boyardee ethnic food.\"\r\n","synonym":""}
{"_id":{"$oid":"5798f4f391d9e3172c560ce0"},"word":"Castigate","level":"Common Words 1","meaning":"To reprimand harshly","example":"Drill sergeants are known to castigate new recruits so mercilessly that the latter often break down during their first week in training.","synonym":""}
{"_id":{"$oid":"5798f51591d9e3172c560ce1"},"word":"Iconoclast","level":"Common Words 1","meaning":"Somebody who attacks cherished beliefs or institutions","example":"Lady Gaga, in challenging what it means to be clothed, is an iconoclast for wearing a \"meat dress\" to a prominent awards show.","synonym":""}
{"_id":{"$oid":"5798f55291d9e3172c560ce2"},"word":"Parsimonious","level":"Common Words 1","meaning":"extremely frugal; miserly","example":"Katie is so parsimonious that she only buys a pair of socks if all of her other socks have holes in them.","synonym":""}
{"_id":{"$oid":"5798f58891d9e3172c560ce3"},"word":"Acrimony","level":"Common Words 1","meaning":"Bitterness and ill will","example":"The acrimony between the president and vice-president sent a clear signal to voters: the health of the current administration was imperiled.","synonym":""}
{"_id":{"$oid":"5798f5ca91d9e3172c560ce4"},"word":"Vindicate","level":"Common Words 1","meaning":"To clear of accusation, blame, suspicion, or doubt with supporting arguments or proof","example":"Even seven Tour de France wins cannot vindicate Lance Armstrong in the eyes of the public--that the athlete used performance enhancing drugs invalidates all those wins.","synonym":""}
{"_id":{"$oid":"5798f5f591d9e3172c560ce5"},"word":"Disinterested","level":"Common Words 1","meaning":"Unbiased; neutral","example":"The potential juror knew the defendant, and therefore could not serve on the jury, which must consist only of disinterested members.","synonym":""}
{"_id":{"$oid":"5798f91a91d9e3172c560ce6"},"word":"Commensurate","level":"Common Words 1","meaning":"To be in proportion or corresponding in degree or amount","example":"The convicted felon’s life sentence was commensurate with the heinousness of his crime."}
{"_id":{"$oid":"5798f94291d9e3172c560ce7"},"word":"Amorphous","level":"Common Words 1","meaning":"Shapeless","example":"His study plan for the GRE was at best amorphous; he would do questions from random pages in any one of seven test prep books.","synonym":""}
{"_id":{"$oid":"5798f98d91d9e3172c560ce8"},"word":"Calumny","level":"Common Words 1","meaning":"Making of a false statement meant to injure a person’s reputation","example":"With the presidential primaries well under way, the air is thick with calumny, and the mud already waist-high.","synonym":""}
{"_id":{"$oid":"5798f9b991d9e3172c560ce9"},"word":"Prodigal","level":"Common Words 1","meaning":"Rashly or wastefully extravagant","example":"Successful professional athletes who do not fall prey to prodigality seem to be the exception—most live decadent lives.","synonym":""}
{"_id":{"$oid":"579971a72d1fa77c31856b0e"},"word":"Mercurial","level":"Common Words 1","meaning":"(of a person) prone to unexpected and unpredictable changes in mood","example":"The fact that Ella’s moods were as mercurial as the weather was problematic for her relationships—it didn’t help that she lived in Chicago.","synonym":""}
{"_id":{"$oid":"579972842d1fa77c31856b0f"},"word":"Chastise","level":"Common Words 1","meaning":"To reprimand harshly","example":"Though chastised for eating the snacks for the party, Lawrence shrugged off his mother’s harsh words, and continued to plow through jars of cookies and boxes of donuts.","synonym":""}
{"_id":{"$oid":"579973592d1fa77c31856b10"},"word":"Amenable","level":"Common Words 1","meaning":"Easily persuaded","example":"Even though she did not like the outdoors, Shirley was generally amenable and so her brother was able to persuade her to go camping.","synonym":""}
{"_id":{"$oid":"5799739e2d1fa77c31856b11"},"word":"Involved","level":"Common Words 1","meaning":"Complicated, and difficult to comprehend","example":"The physics lecture became so involved that the undergraduate’s eyes glazed over.","synonym":""}
{"_id":{"$oid":"579973bd2d1fa77c31856b12"},"word":"Undermine","level":"Common Words 1","meaning":"To weaken (usually paired with an abstract term)","example":"The student undermined the teacher’s authority by questioning the teacher’s judgment on numerous occasions.","synonym":""}
{"_id":{"$oid":"5799743a2d1fa77c31856b13"},"word":"Prevaricate","level":"Common Words 1","meaning":"To speak in an evasive way","example":"The cynic quipped, “There is not much variance in politicians; they all seem to prevaricate”.","synonym":""}
{"_id":{"$oid":"579974672d1fa77c31856b14"},"word":"Demur","level":"Common Words 1","meaning":"To object or show reluctance","example":"Wallace disliked the cold, so he demurred when his friends suggested they go skiing in the Alps.","synonym":""}
{"_id":{"$oid":"579974c52d1fa77c31856b15"},"word":"Betray","level":"Common Words 1","meaning":"To reveal or make known something, usually unintentionally","example":"With the gold medal at stake, the gymnast awaited his turn, his quivering lip betraying his intense emotions.","synonym":""}
{"_id":{"$oid":"579975172d1fa77c31856b16"},"word":"Qualify","level":"Common Words 1","meaning":"To make less severe; to limit (a statement)","example":"Chris qualified his love for San Francisco, adding he didn't like the weather there as much as he liked the weather in Los Angeles.","synonym":""}
{"_id":{"$oid":"579975cc2d1fa77c31856b17"},"word":"Ingenuous","level":"Common Words 1","meaning":"To be naïve and innocent","example":"Two-years in Manhattan had changed Jenna from an ingenuous girl from the suburbs to a jaded urbanite, unlikely to fall for any ruse, regardless of how elaborate.","synonym":""}
{"_id":{"$oid":"579976c32d1fa77c31856b18"},"word":"Restive","level":"Common Words 1","meaning":"Restless","example":"The crowd grew restive as the comedian’s opening jokes fell flat.","synonym":""}
{"_id":{"$oid":"5799771c2d1fa77c31856b19"},"word":"Profligate","level":"Common Words 1","meaning":"Spending resources recklessly or wastefully","example":"The composer Wagner, while living on a limited salary, was so profligate as to line all the walls of his apartment with pure silk.","synonym":""}
{"_id":{"$oid":"579978032d1fa77c31856b1a"},"word":"Wanting","level":"Common Words 1","meaning":"Lacking","example":"She did not think her vocabulary was wanting, yet there were so many words that inevitably she found a few she didn't know.","synonym":""}
{"_id":{"$oid":"579979122d1fa77c31856b1b"},"word":"Extant","level":"Common Words 1","meaning":"Still in existence (usually refers to documents).","example":"Despite many bookstores closing, experts predict that some form of book dealing will still be extant generations from now.","synonym":""}
{"_id":{"$oid":"57997a502d1fa77c31856b1c"},"word":"Upbraid","level":"Common Words 1","meaning":"To reproach; to scold","example":"Bob took a risk walking into the \"Students Barbershop\"—in the end he had to upbraid the apparently drunk barber for giving him an uneven bowl cut.","synonym":""}
